codeigniter/app/Models/AufgabenModel.php

    public function getAufgaben ($aufgaben_id = NULL) {
        $this->aufgaben = $this->db->table('aufgaben');
        $this->aufgaben->select('*');

        IF ($aufgaben_id != NULL)
            $this->aufgaben->where('aufgaben.id_aufgaben', $aufgaben_id);

        $this->aufgaben->orderBy('name');
        $result = $this->aufgaben->get();
---
SELECT *
FROM `aufgaben`
ORDER BY `name`