codeigniter/app/Models/ProjekteModel.php

SELECT *
FROM `projekte`
WHERE `projekte`.`id_projekte` = '34'
ORDER BY `name`
---
    public function getProjekte($projekte_id = NULL) {
        $this->projekte = $this->db->table('projekte');
        $this->projekte->select('*');

        IF ($projekte_id != NULL)
            $this->projekte->where('projekte.id_projekte', $projekte_id);

        $this->projekte->orderBy('name');
        $result = $this->projekte->get();

INSERT INTO `projekte` (`name`, `beschreibung`, `id_ersteller`) VALUES ('2', '2', '1')
---
    public function createProjekte() {

        $this->projekte = $this->db->table('projekte');
        $this->projekte->insert(array(
            'name' => $_POST['name'],
            'beschreibung' => $_POST['beschreibung'],
            'id_ersteller' => $_POST['id_ersteller']
        ));

DELETE FROM `projekte`
WHERE `projekte`.`id_projekte` = '27'
---
    public function deleteProjekte() {
        $this->projekte = $this->db->table('projekte');
        $this->projekte->where('projekte.id_projekte', $_POST['id_projekte']);
        $this->projekte->delete();

SELECT *
FROM `projekte_mitglieder`
WHERE `id_projekte` = '34'
AND `id_mitglieder` = '3'
---
    public function worksOnProjekte_Mitglieder($mitglieder_id, $projekte_id) {
        $this->projekte_mitglieder = $this->db->table('projekte_mitglieder');
        $this->projekte_mitglieder->where('id_projekte', $projekte_id);
        $this->projekte_mitglieder->where('id_mitglieder',$mitglieder_id);
        $get = $this->projekte_mitglieder->get()->getResultArray();