app/Models/MitgliederModel.php

SELECT *
FROM `mitglieder`
ORDER BY `username`
---
    public function getMitglieder ($mitglieder_username = NULL) {
        $this->mitglieder = $this->db->table('mitglieder');
        $this->mitglieder->select('*');

        IF ($mitglieder_username != NULL)
            $this->mitglieder->where('mitglieder.username', $mitglieder_username);

        $this->mitglieder->orderBy('username');
        $result = $this->mitglieder->get();

DELETE FROM `mitglieder`
WHERE `mitglieder`.`id_mitglieder` = '50'
---
    public function deleteMitglieder() {
        $this->mitglieder = $this->db->table('mitglieder');
        $this->mitglieder->where('mitglieder.id_mitglieder', $_POST['id_mitglieder']);
        $this->mitglieder->delete();