app/Models/ProjekteModel.php

    public function getProjekte($projekte_id = NULL) {
        $this->projekte = $this->db->table('projekte');
        $this->projekte->select('*');

        IF ($projekte_id != NULL)
            $this->projekte->where('projekte.id_projekte', $projekte_id);

        $this->projekte->orderBy('name');
        $result = $this->projekte->get();
---
SELECT *
FROM `projekte`
WHERE `projekte`.`id_projekte` = '1'
ORDER BY `name`

    public function getProjekte_Mitglieder($projekte_mitglieder_id = NULL) {
        $this->projekte_mitglieder = $this->db->table('projekte_mitglieder');
        $this->projekte_mitglieder->select('*');

        if ($projekte_mitglieder_id != NULL)
            $this->projekte_mitglieder->where('id_mitglieder', $projekte_mitglieder_id);

        //$this->projekte_mitglieder->orderBy('id_projekte');
        $result = $this->projekte_mitglieder->get();
---
SELECT *
FROM `projekte_mitglieder`

    public function deleteProjekte_Mitglieder() {
        $this->projekte_mitglieder = $this->db->table('projekte_mitglieder');
        $this->projekte_mitglieder->where('id_projekte', $_POST['id_projekte']);
        $this->projekte_mitglieder->where('id_mitglieder',$_POST['id_mitglieder']);
---
SELECT *
FROM `projekte_mitglieder`
WHERE `id_projekte` = '1'
AND `id_mitglieder` = '1'

    public function worksNotOnProjekte_Mitglieder($mitglieder_id, $projekte_id) {
        $this->projekte_mitglieder = $this->db->table('projekte_mitglieder');
        $this->projekte_mitglieder->where('id_projekte', $projekte_id);
        $this->projekte_mitglieder->where('id_mitglieder',$mitglieder_id);
        $get = $this->projekte_mitglieder->get()->getResultArray();
---
SELECT *
FROM `projekte_mitglieder`
WHERE `id_projekte` = '1'
AND `id_mitglieder` = '1'