app/Models/ReiterModel.php

SELECT *
FROM `reiter`
ORDER BY `name`
---
    public function getReiter($reiter_id = NULL) {
        $this->reiter = $this->db->table('reiter');
        $this->reiter->select('*');

        IF ($reiter_id != NULL)
            $this->reiter->where('reiter.id_reiter', $reiter_id);

        $this->reiter->orderBy('name');
        $result = $this->reiter->get();